In [1]:
import pandas as pd

* dictionary를 이용해서 만드는 데이터 프레임

In [3]:
df = pd.DataFrame({'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]})

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [7]:
dummy = {'a' : [1, 2, 3], 'b' : [4, 5, 6], 'c' : [7, 8, 9]}

In [8]:
df2 = pd.DataFrame(dummy)

In [9]:
df2

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

* List를 이용한 데이터 프레임

In [10]:
a = [[1, 4, 7], [2, 5, 6], [3, 6, 9]]

In [11]:
df3 = pd.DataFrame(a)

In [12]:
df3

   0  1  2
0  1  4  7
1  2  5  6
2  3  6  9

In [13]:
df3.columns = ['a', 'b', 'c']

In [14]:
df3

   a  b  c
0  1  4  7
1  2  5  6
2  3  6  9